TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/inc/stm32_tsl_checkconfig.h
/**
  ******************************************************************************
  * @file    stm32_tsl_checkconfig.h
  * @author  MCD Application Team
  * @version v0.1.3
  * @date    23-September-2011
  * @brief   STM32 Touch Sensing Library - This file checks the configuration
  *          file options.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __TSL_CHECKCONFIG_H
#define __TSL_CHECKCONFIG_H

/* Includes ------------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

//------------------------------------------------------------------------------
// MCU check and Standard Peripheral Library selection
//------------------------------------------------------------------------------

#if defined(STM32L15XX8_64K) && defined(STM32L15XXB_128K)
#error "Wrong device selection (select only one device)."
#endif

#if !defined(STM32L15XX8_64K) && !defined(STM32L15XXB_128K)
#error "No device selected (STM32L15XX8_64K or STM32L15XXB_128K must be selected)."
#endif

#if defined(STM32L15XX8_64K) || defined(STM32L15XXB_128K)
#define STM32L15XX8B (1) // Generic name used in the library
#include "stm32l1xx.h" // Standard Peripherals Library
#endif

//------------------------------------------------------------------------------
// Single channel keys check and definitions
//------------------------------------------------------------------------------

#if (SCKEY_P1_KEY_COUNT < 0) || (SCKEY_P1_KEY_COUNT > 10)
#error "Wrong number of single channel keys on port1. Must be in the [0..10] range."
#endif

#if (SCKEY_P2_KEY_COUNT < 0) || (SCKEY_P2_KEY_COUNT > 10)
#error "Wrong number of single channel keys on port2. Must be in the [0..10] range."
#endif

#if (SCKEY_P3_KEY_COUNT < 0) || (SCKEY_P3_KEY_COUNT > 10)
#error "Wrong number of single channel keys on port3. Must be in the [0..10] range."
#endif

#if ((SCKEY_P1_KEY_COUNT == 0) && ((SCKEY_P2_KEY_COUNT > 0) || (SCKEY_P3_KEY_COUNT > 0)))
#error "Key(s) defined on PORT2 or PORT3 while no key seems defined on PORT1. PORT1 must be used before using PORT2 or PORT3"
#endif

#if ((SCKEY_P2_KEY_COUNT == 0) && (SCKEY_P3_KEY_COUNT > 0))
#error "Key(s) defined on PORT3 while no key seems defined on PORT2. PORT2 must be used before using PORT3"
#endif

// Calculates the total number of single channel keys
#define NUMBER_OF_SINGLE_CHANNEL_KEYS (SCKEY_P1_KEY_COUNT + SCKEY_P2_KEY_COUNT + SCKEY_P3_KEY_COUNT)

// Define the number of single channel "ports" used
#if (SCKEY_P1_KEY_COUNT == 0)
#define NUMBER_OF_SINGLE_CHANNEL_PORTS (0)
#else // SCKEY_P1_KEY_COUNT > 0
#if ((SCKEY_P2_KEY_COUNT == 0) && (SCKEY_P3_KEY_COUNT == 0))
#define NUMBER_OF_SINGLE_CHANNEL_PORTS (1)
#endif
#if ((SCKEY_P2_KEY_COUNT > 0) && (SCKEY_P3_KEY_COUNT == 0))
#define NUMBER_OF_SINGLE_CHANNEL_PORTS (2)
#endif
#if ((SCKEY_P2_KEY_COUNT > 0) && (SCKEY_P3_KEY_COUNT > 0))
#define NUMBER_OF_SINGLE_CHANNEL_PORTS (3)
#endif
#if ((SCKEY_P2_KEY_COUNT == 0) && (SCKEY_P3_KEY_COUNT > 0))
#error "SCKEY PORT2 is not defined (mandatory if PORT3 is defined)."
#endif
#endif // SCKEY_P1_KEY_COUNT > 0

// Remove channels assignation if any
#if (SCKEY_P1_KEY_COUNT == 0)
#undef SCKEY_P1_CH
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 0
#define SCKEY_P1_CH (0)
#elif NUMBER_OF_MULTI_CHANNEL_KEYS > 0
#if ((MCKEY1_A_CH == CH1) && (MCKEY1_B_CH == CH1) && (MCKEY1_C_CH == CH1))
#define SCKEY_P1_CH (CH1)
#elif ((MCKEY1_A_CH == CH2) && (MCKEY1_B_CH == CH2) && (MCKEY1_C_CH == CH2))
#define SCKEY_P1_CH (CH2)
#elif ((MCKEY1_A_CH == CH3) && (MCKEY1_B_CH == CH3) && (MCKEY1_C_CH == CH3))
#define SCKEY_P1_CH (CH3)
#elif ((MCKEY1_A_CH == CH4) && (MCKEY1_B_CH == CH4) && (MCKEY1_C_CH == CH4))
#define SCKEY_P1_CH (CH4)
#else
#define SCKEY_P1_CH  (MCKEY1_A_CH)
#endif
#endif
#endif

#if (SCKEY_P2_KEY_COUNT == 0)
#undef SCKEY_P2_CH
#if NUMBER_OF_MULTI_CHANNEL_KEYS < 2
#define SCKEY_P2_CH (0)
#elif NUMBER_OF_MULTI_CHANNEL_KEYS > 1
#if ((MCKEY2_A_CH == CH1) && (MCKEY2_B_CH == CH1) && (MCKEY2_C_CH == CH1))
#define SCKEY_P2_CH (CH1)
#elif ((MCKEY2_A_CH == CH2) && (MCKEY2_B_CH == CH2) && (MCKEY2_C_CH == CH2))
#define SCKEY_P2_CH (CH2)
#elif ((MCKEY2_A_CH == CH3) && (MCKEY2_B_CH == CH3) && (MCKEY2_C_CH == CH3))
#define SCKEY_P2_CH (CH3)
#elif ((MCKEY2_A_CH == CH4) && (MCKEY2_B_CH == CH4) && (MCKEY2_C_CH == CH4))
#define SCKEY_P2_CH (CH4)
#else
#define SCKEY_P2_CH (MCKEY1_B_CH)
#endif
#endif
#endif

#if (SCKEY_P3_KEY_COUNT == 0)
#undef SCKEY_P3_CH
#define SCKEY_P3_CH (0)
#endif

// Define acquisition "ports"
#define SCKEY_P1_ACQ  (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J)

#define SCKEY_P2_ACQ  (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J)

#define SCKEY_P3_ACQ  (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J)


//------------------------------------------------------------------------------
// Multi channel keys check and definitions
//------------------------------------------------------------------------------

