TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/inc/stm32_tsl_checkconfig.h
// Check number of MCkeys
#if (NUMBER_OF_MULTI_CHANNEL_KEYS < 0) || (NUMBER_OF_MULTI_CHANNEL_KEYS > 2)
#error "Wrong number of multi channel keys. Must be in the [0..2] range."
#endif

// Check MCKeys type
#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)
#if (MCKEY1_TYPE != 0) && (MCKEY1_TYPE != 1)
#error "Wrong MCKEY1 type. Must be equal to 0 (wheel) or 1 (slider)."
#endif
#endif // NUMBER_OF_MULTI_CHANNEL_KEYS > 0

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 1)
#if (MCKEY2_TYPE != 0) && (MCKEY2_TYPE != 1)
#error "Wrong MCKEY2 type. Must be equal to 0 (wheel) or 1 (slider)."
#endif
#endif // NUMBER_OF_MULTI_CHANNEL_KEYS > 1

// PORT MASK definition
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 0

#define MKEY_CH1_MASK (0)
#define MKEY_CH2_MASK (0)
#define MKEY_CH3_MASK (0)

#elif NUMBER_OF_MULTI_CHANNEL_KEYS == 1

#define MKEY_CH1_MASK \
  ( ((MCKEY1_A_CH == CH1)? MCKEY1_A:0)|((MCKEY1_B_CH == CH1)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH1)? MCKEY1_C:0) )
#define MKEY_CH2_MASK \
  ( ((MCKEY1_A_CH == CH2)? MCKEY1_A:0)|((MCKEY1_B_CH == CH2)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH2)? MCKEY1_C:0) )
#define MKEY_CH3_MASK \
  ( ((MCKEY1_A_CH == CH3)? MCKEY1_A:0)|((MCKEY1_B_CH == CH3)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH3)? MCKEY1_C:0) )
#define MKEY_CH4_MASK \
  ( ((MCKEY1_A_CH == CH4)? MCKEY1_A:0)|((MCKEY1_B_CH == CH4)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH4)? MCKEY1_C:0) )

#elif NUMBER_OF_MULTI_CHANNEL_KEYS == 2

#define MKEY_CH1_MASK \
  ( ((MCKEY1_A_CH == CH1)? MCKEY1_A:0)|((MCKEY1_B_CH == CH1)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH1)? MCKEY1_C:0)|\
    ((MCKEY2_A_CH == CH1)? MCKEY2_A:0)|((MCKEY2_B_CH == CH1)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH1)? MCKEY2_C:0) )
#define MKEY_CH2_MASK \
  ( ((MCKEY1_A_CH == CH2)? MCKEY1_A:0)|((MCKEY1_B_CH == CH2)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH2)? MCKEY1_C:0)|\
    ((MCKEY2_A_CH == CH2)? MCKEY2_A:0)|((MCKEY2_B_CH == CH2)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH2)? MCKEY2_C:0) )
#define MKEY_CH3_MASK \
  ( ((MCKEY1_A_CH == CH3)? MCKEY1_A:0)|((MCKEY1_B_CH == CH3)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH3)? MCKEY1_C:0)|\
    ((MCKEY2_A_CH == CH3)? MCKEY2_A:0)|((MCKEY2_B_CH == CH3)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH3)? MCKEY2_C:0) )
#define MKEY_CH4_MASK \
  ( ((MCKEY1_A_CH == CH4)? MCKEY1_A:0)|((MCKEY1_B_CH == CH4)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH4)? MCKEY1_C:0)|\
    ((MCKEY2_A_CH == CH4)? MCKEY2_A:0)|((MCKEY2_B_CH == CH4)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH4)? MCKEY2_C:0) )

#endif


//------------------------------------------------------------------------------
// Assign Comparators
//------------------------------------------------------------------------------

#ifdef COMP1
#undef COMP1
#endif

#ifdef COMP2
#undef COMP2
#endif

#if ((SCKEY_P1_ACQ & GROUP1) == GROUP1) || ((SCKEY_P1_ACQ & GROUP2) == GROUP2) || ((SCKEY_P1_ACQ & GROUP3) == GROUP3) ||\
    ((SCKEY_P2_ACQ & GROUP1) == GROUP1) || ((SCKEY_P2_ACQ & GROUP2) == GROUP2) || ((SCKEY_P2_ACQ & GROUP3) == GROUP3) ||\
    ((SCKEY_P3_ACQ & GROUP1) == GROUP1) || ((SCKEY_P3_ACQ & GROUP2) == GROUP2) || ((SCKEY_P3_ACQ & GROUP3) == GROUP3) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP1) == GROUP1) || ((ACTIVE_SHIELD_GROUP & GROUP2) == GROUP2) || ((ACTIVE_SHIELD_GROUP & GROUP3) == GROUP3) ||\
    ((SCKEY_P1_ACQ & GROUP7) == GROUP7) || ((SCKEY_P1_ACQ & GROUP8) == GROUP8) || ((SCKEY_P1_ACQ & GROUP9) == GROUP9) ||\
    ((SCKEY_P2_ACQ & GROUP7) == GROUP7) || ((SCKEY_P2_ACQ & GROUP8) == GROUP8) || ((SCKEY_P2_ACQ & GROUP9) == GROUP9) ||\
    ((SCKEY_P3_ACQ & GROUP7) == GROUP7) || ((SCKEY_P3_ACQ & GROUP8) == GROUP8) || ((SCKEY_P3_ACQ & GROUP9) == GROUP9) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP7) == GROUP7) || ((ACTIVE_SHIELD_GROUP & GROUP8) == GROUP8) || ((ACTIVE_SHIELD_GROUP & GROUP9) == GROUP9) ||\
    ((MKEY_CH1_MASK & GROUP7) == GROUP7) || ((MKEY_CH1_MASK & GROUP8) == GROUP8) || ((MKEY_CH1_MASK & GROUP9) == GROUP9) ||\
    ((MKEY_CH2_MASK & GROUP7) == GROUP7) || ((MKEY_CH2_MASK & GROUP8) == GROUP8) || ((MKEY_CH2_MASK & GROUP9) == GROUP9) ||\
    ((MKEY_CH3_MASK & GROUP7) == GROUP7) || ((MKEY_CH3_MASK & GROUP8) == GROUP8) || ((MKEY_CH3_MASK & GROUP9) == GROUP9) ||\
    ((MKEY_CH4_MASK & GROUP7) == GROUP7) || ((MKEY_CH4_MASK & GROUP8) == GROUP8) || ((MKEY_CH4_MASK & GROUP9) == GROUP9)
#define COMP1 (1)
#endif

#if ((SCKEY_P1_ACQ & GROUP4) == GROUP4) || ((SCKEY_P1_ACQ & GROUP5) == GROUP5) ||\
    ((SCKEY_P2_ACQ & GROUP4) == GROUP4) || ((SCKEY_P2_ACQ & GROUP5) == GROUP5) ||\
    ((SCKEY_P3_ACQ & GROUP4) == GROUP4) || ((SCKEY_P3_ACQ & GROUP5) == GROUP5) ||\
    ((SCKEY_P1_ACQ & GROUP6) == GROUP6) || ((SCKEY_P1_ACQ & GROUP10) == GROUP10) ||\
    ((SCKEY_P2_ACQ & GROUP6) == GROUP6) || ((SCKEY_P2_ACQ & GROUP10) == GROUP10) ||\
    ((SCKEY_P3_ACQ & GROUP6) == GROUP6) || ((SCKEY_P3_ACQ & GROUP10) == GROUP10) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP4) == GROUP4) || ((ACTIVE_SHIELD_GROUP & GROUP5) == GROUP5) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP6) == GROUP6) || ((ACTIVE_SHIELD_GROUP & GROUP10) == GROUP10) ||\
    ((MKEY_CH1_MASK & GROUP4) == GROUP4) || ((MKEY_CH1_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH2_MASK & GROUP4) == GROUP4) || ((MKEY_CH2_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH3_MASK & GROUP4) == GROUP4) || ((MKEY_CH3_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH4_MASK & GROUP4) == GROUP4) || ((MKEY_CH4_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH1_MASK & GROUP6) == GROUP6) || ((MKEY_CH1_MASK & GROUP10) == GROUP10) ||\
    ((MKEY_CH2_MASK & GROUP6) == GROUP6) || ((MKEY_CH2_MASK & GROUP10) == GROUP10) ||\
    ((MKEY_CH3_MASK & GROUP6) == GROUP6) || ((MKEY_CH3_MASK & GROUP10) == GROUP10) ||\
    ((MKEY_CH4_MASK & GROUP6) == GROUP6) || ((MKEY_CH4_MASK & GROUP10) == GROUP10)
#define COMP2 (1)
#endif


//------------------------------------------------------------------------------
// Assign PORTS
//------------------------------------------------------------------------------

#ifdef PORT_A
#undef PORT_A
#endif

#ifdef PORT_B
#undef PORT_B
#endif

#ifdef PORT_C
#undef PORT_C
#endif

#if ((SCKEY_P1_ACQ & GROUP1) == GROUP1) || ((SCKEY_P1_ACQ & GROUP2) == GROUP2) ||\
    ((SCKEY_P2_ACQ & GROUP1) == GROUP1) || ((SCKEY_P2_ACQ & GROUP2) == GROUP2) ||\
    ((SCKEY_P3_ACQ & GROUP1) == GROUP1) || ((SCKEY_P3_ACQ & GROUP2) == GROUP2) ||\
    ((SCKEY_P1_ACQ & GROUP4) == GROUP4) || ((SCKEY_P1_ACQ & GROUP5) == GROUP5) ||\
    ((SCKEY_P2_ACQ & GROUP4) == GROUP4) || ((SCKEY_P2_ACQ & GROUP5) == GROUP5) ||\
    ((SCKEY_P3_ACQ & GROUP4) == GROUP4) || ((SCKEY_P3_ACQ & GROUP5) == GROUP5) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP1) == GROUP1) || ((ACTIVE_SHIELD_GROUP & GROUP2) == GROUP2) ||\
    ((ACTIVE_SHIELD_GROUP & GROUP4) == GROUP4) || ((ACTIVE_SHIELD_GROUP & GROUP5) == GROUP5) ||\
    ((MKEY_CH1_MASK & GROUP1) == GROUP1) || ((MKEY_CH1_MASK & GROUP2) == GROUP2) ||\
    ((MKEY_CH2_MASK & GROUP1) == GROUP1) || ((MKEY_CH2_MASK & GROUP2) == GROUP2) ||\
    ((MKEY_CH3_MASK & GROUP1) == GROUP1) || ((MKEY_CH3_MASK & GROUP2) == GROUP2) ||\
    ((MKEY_CH4_MASK & GROUP1) == GROUP1) || ((MKEY_CH4_MASK & GROUP2) == GROUP2) ||\
    ((MKEY_CH1_MASK & GROUP4) == GROUP4) || ((MKEY_CH1_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH2_MASK & GROUP4) == GROUP4) || ((MKEY_CH2_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH3_MASK & GROUP4) == GROUP4) || ((MKEY_CH3_MASK & GROUP5) == GROUP5) ||\
    ((MKEY_CH4_MASK & GROUP4) == GROUP4) || ((MKEY_CH4_MASK & GROUP5) == GROUP5)
#define PORT_A (1)
#endif

#if ((SCKEY_P1_ACQ & GROUP3) == GROUP3) || ((SCKEY_P1_ACQ & GROUP6) == GROUP6) || ((SCKEY_P1_ACQ & GROUP7) == GROUP7)||\
    ((SCKEY_P2_ACQ & GROUP3) == GROUP3) || ((SCKEY_P2_ACQ & GROUP6) == GROUP6) || ((SCKEY_P2_ACQ & GROUP7) == GROUP7)||\
    ((SCKEY_P3_ACQ & GROUP3) == GROUP3) || ((SCKEY_P3_ACQ & GROUP6) == GROUP6) || ((SCKEY_P3_ACQ & GROUP7) == GROUP7)||\
    ((ACTIVE_SHIELD_GROUP & GROUP3) == GROUP3) || ((ACTIVE_SHIELD_GROUP & GROUP6) == GROUP6) || ((ACTIVE_SHIELD_GROUP & GROUP7) == GROUP7) ||\
    ((MKEY_CH1_MASK & GROUP3) == GROUP3) || ((MKEY_CH1_MASK & GROUP6) == GROUP6) || ((MKEY_CH1_MASK & GROUP7) == GROUP7)||\
    ((MKEY_CH2_MASK & GROUP3) == GROUP3) || ((MKEY_CH2_MASK & GROUP6) == GROUP6) || ((MKEY_CH2_MASK & GROUP7) == GROUP7)||\
    ((MKEY_CH3_MASK & GROUP3) == GROUP3) || ((MKEY_CH3_MASK & GROUP6) == GROUP6) || ((MKEY_CH3_MASK & GROUP7) == GROUP7)||\
    ((MKEY_CH4_MASK & GROUP3) == GROUP3) || ((MKEY_CH4_MASK & GROUP6) == GROUP6) || ((MKEY_CH4_MASK & GROUP7) == GROUP7)
#define PORT_B (1)
#endif

#if ((SCKEY_P1_ACQ & GROUP8) == GROUP8) || ((SCKEY_P1_ACQ & GROUP9) == GROUP9) || ((SCKEY_P1_ACQ & GROUP10) == GROUP10)||\
    ((SCKEY_P2_ACQ & GROUP8) == GROUP8) || ((SCKEY_P2_ACQ & GROUP9) == GROUP9) || ((SCKEY_P2_ACQ & GROUP10) == GROUP10)||\
    ((SCKEY_P3_ACQ & GROUP8) == GROUP8) || ((SCKEY_P3_ACQ & GROUP9) == GROUP9) || ((SCKEY_P3_ACQ & GROUP10) == GROUP10)||\
    ((ACTIVE_SHIELD_GROUP & GROUP8) == GROUP8) || ((ACTIVE_SHIELD_GROUP & GROUP9) == GROUP9) || ((ACTIVE_SHIELD_GROUP & GROUP10) == GROUP10)||\
    ((MKEY_CH1_MASK & GROUP8) == GROUP8) || ((MKEY_CH1_MASK & GROUP9) == GROUP9) || ((MKEY_CH1_MASK & GROUP10) == GROUP10)||\
    ((MKEY_CH2_MASK & GROUP8) == GROUP8) || ((MKEY_CH2_MASK & GROUP9) == GROUP9) || ((MKEY_CH2_MASK & GROUP10) == GROUP10)||\
    ((MKEY_CH3_MASK & GROUP8) == GROUP8) || ((MKEY_CH3_MASK & GROUP9) == GROUP9) || ((MKEY_CH3_MASK & GROUP10) == GROUP10)||\
    ((MKEY_CH4_MASK & GROUP8) == GROUP8) || ((MKEY_CH4_MASK & GROUP9) == GROUP9) || ((MKEY_CH4_MASK & GROUP10) == GROUP10)
#define PORT_C (1)
#endif


//------------------------------------------------------------------------------
// Check sampling capacitor channel settings
//------------------------------------------------------------------------------

#if ((SAMP_CAP_CH != CH1) && (SAMP_CAP_CH != CH2) && (SAMP_CAP_CH != CH3) && (SAMP_CAP_CH != CH4))
#error "Wrong channel assigment: SAMP_CAP_CH must be defined to CH1, CH2, CH3 or CH4 only"
#endif

#if (SCKEY_P1_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P1_CH and SAMP_CAP_CH must be different"
#endif

