TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/inc/stm32_tsl_checkconfig.h
#if (SCKEY_P2_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P2_CH and SAMP_CAP_CH must be different"
#endif

#if (SCKEY_P3_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P3_CH and SAMP_CAP_CH must be different"
#endif

//------------------------------------------------------------------------------
// Check sampling capacitor channel settings versus the pin used to shield
//------------------------------------------------------------------------------

#define SHIELD_MODER_MASK_A_OUT  (0)
#define SHIELD_MODER_MASK_A      (0)
#define SHIELD_IO_MASK_A         (0)
#define SHIELD_MODER_MASK_B_OUT  (0)
#define SHIELD_MODER_MASK_B      (0)
#define SHIELD_IO_MASK_B         (0)
#define SHIELD_MODER_MASK_C_OUT  (0)
#define SHIELD_MODER_MASK_C      (0)
#define SHIELD_IO_MASK_C         (0)
#define SHIELD_COMP1_MASK        (0)
#define SHIELD_COMP2_MASK        (0)

#if (ACTIVE_SHIELD_CHANNEL > 0)

#if (ACTIVE_SHIELD_CHANNEL != CH1) && (ACTIVE_SHIELD_CHANNEL != CH2) && (ACTIVE_SHIELD_CHANNEL != CH3) && (ACTIVE_SHIELD_CHANNEL != CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1, CH2, CH3 or CH4!"
#endif

#if (ACTIVE_SHIELD_CHANNEL == SAMP_CAP_CH)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be different with SAMP_CAP_CH!"
#endif

#if (ACTIVE_SHIELD_GROUP == GROUP1)
#undef SHIELD_MODER_MASK_A_OUT
#undef SHIELD_MODER_MASK_A
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_A
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00000001)   /* PA0 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x00000003)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000001)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000001)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00000004)   /* PA1 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x0000000C)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000002)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000002)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00000010)   /* PA2 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x00000030)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000004)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000004)
#elif (ACTIVE_SHIELD_CHANNEL == CH4)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00000040)   /* PA3 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x000000C0)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000008)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000008)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP2)
#if (ACTIVE_SHIELD_CHANNEL == CH3) && (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1 or CH2 with GROUP2!"
#endif
#undef SHIELD_MODER_MASK_A_OUT
#undef SHIELD_MODER_MASK_A
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_A
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00001000)   /* PA6 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x00003000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000040)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000040)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00004000)   /* PA7 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x0000C000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000080)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000080)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP3)
#if (ACTIVE_SHIELD_CHANNEL == CH3) && (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1 or CH2 with GROUP3!"
#endif
#undef SHIELD_MODER_MASK_B_OUT
#undef SHIELD_MODER_MASK_B
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_B
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x00000001)   /* PB0 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x00000003)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000100)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00000001)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x00000004)   /* PB1 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x0000000C)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000200)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00000002)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP4)
#if (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1, CH2 or CH3 with GROUP4!"
#endif
#undef SHIELD_MODER_MASK_A_OUT
#undef SHIELD_MODER_MASK_A
#undef SHIELD_COMP2_MASK
#undef SHIELD_IO_MASK_A
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00010000)   /* PA8 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x00030000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000200)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000100)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00040000)   /* PA9 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x000C0000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000400)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000200)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x00100000)   /* PA10 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x00300000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000800)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00000400)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP5)
#if (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1, CH2 or CH3 with GROUP5!"
#endif
#undef SHIELD_MODER_MASK_A_OUT
#undef SHIELD_MODER_MASK_A
#undef SHIELD_COMP2_MASK
#undef SHIELD_IO_MASK_A
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x04000000)   /* PA13 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x0C000000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000040)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00002000)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x10000000)   /* PA14 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0x30000000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000080)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00004000)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_A_OUT  ((uint32_t)0x40000000)   /* PA15 */
#define SHIELD_MODER_MASK_A      ((uint32_t)0xC0000000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000100)
#define SHIELD_IO_MASK_A         ((uint32_t)0x00008000)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP6)
#if (ACTIVE_SHIELD_CHANNEL == CH3) || (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1 or CH2 with GROUP6!"
#endif
#undef SHIELD_MODER_MASK_B_OUT
#undef SHIELD_MODER_MASK_B
#undef SHIELD_COMP2_MASK
#undef SHIELD_IO_MASK_B
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x00000100)   /* PB4 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x00000300)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000010)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00000010)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x00000400)   /* PB5 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x00000C00)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000020)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00000020)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP7)
#undef SHIELD_MODER_MASK_B_OUT
#undef SHIELD_MODER_MASK_B
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_B
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x01000000)   /* PB12 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x03000000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00040000)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00001000)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x04000000)   /* PB13 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x0C000000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00080000)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00002000)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x10000000)   /* PB14 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0x30000000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00100000)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00004000)
#elif (ACTIVE_SHIELD_CHANNEL == CH4)
#define SHIELD_MODER_MASK_B_OUT  ((uint32_t)0x40000000)   /* PB15 */
#define SHIELD_MODER_MASK_B      ((uint32_t)0xC0000000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00200000)
#define SHIELD_IO_MASK_B         ((uint32_t)0x00008000)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP8)
#undef SHIELD_MODER_MASK_C_OUT
#undef SHIELD_MODER_MASK_C
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_C
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000001)   /* PC0 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00000003)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000400)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000001)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000004)   /* PC1 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x0000000C)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000800)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000002)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000010)   /* PC2 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00000030)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00001000)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000004)
#elif (ACTIVE_SHIELD_CHANNEL == CH4)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000040)   /* PC3 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x000000C0)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00002000)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000008)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP9)
#if (ACTIVE_SHIELD_CHANNEL == CH3) || (ACTIVE_SHIELD_CHANNEL == CH4)
#error "Wrong channel assigment: ACTIVE_SHIELD_CHANNEL must be CH1 or CH2 with GROUP9!"
#endif
#undef SHIELD_MODER_MASK_C_OUT
#undef SHIELD_MODER_MASK_C
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_C
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000100)   /* PC4 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00000300)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00004000)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000010)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00000400)   /* PC5 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00000C00)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00008000)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000020)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP10)
#undef SHIELD_MODER_MASK_C_OUT
#undef SHIELD_MODER_MASK_C
#undef SHIELD_COMP1_MASK
#undef SHIELD_IO_MASK_C
#if (ACTIVE_SHIELD_CHANNEL == CH1)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00001000)   /* PC6 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00003000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000001)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000040)
#elif (ACTIVE_SHIELD_CHANNEL == CH2)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00004000)   /* PC7 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x0000C000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000002)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000080)
#elif (ACTIVE_SHIELD_CHANNEL == CH3)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00010000)   /* PC8 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x00030000)
#define SHIELD_COMP1_MASK        ((uint32_t)0x00000004)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000100)
#elif (ACTIVE_SHIELD_CHANNEL == CH4)
#define SHIELD_MODER_MASK_C_OUT  ((uint32_t)0x00040000)   /* PC9 */
#define SHIELD_MODER_MASK_C      ((uint32_t)0x000C0000)
#define SHIELD_COMP2_MASK        ((uint32_t)0x00000008)
#define SHIELD_IO_MASK_C         ((uint32_t)0x00000200)
#endif
#endif /* ACTIVE_SHIELD_GROUP */
#endif /* ACTIVE_SHIELD_CHANNEL */

//----------------------------------------------------------------------------
// Acquisition slot selection
//----------------------------------------------------------------------------

#if (NUMBER_OF_MULTI_CHANNEL_KEYS == 0)
#define MCKEY1_USE_P1 (0)
#define MCKEY1_USE_P2 (0)
#define MCKEY1_USE_P3 (0)
#define MCKEY2_USE_P1 (0)
#define MCKEY2_USE_P2 (0)
#define MCKEY2_USE_P3 (0)
#endif

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)
#define MCKEY1_USE_P1 (((MCKEY1_A_CH == SCKEY_P1_CH)?1:0) | ((MCKEY1_B_CH == SCKEY_P1_CH)?1:0) | ((MCKEY1_C_CH == SCKEY_P1_CH)?1:0))
#define MCKEY1_USE_P2 (((MCKEY1_A_CH == SCKEY_P2_CH)?1:0) | ((MCKEY1_B_CH == SCKEY_P2_CH)?1:0) | ((MCKEY1_C_CH == SCKEY_P2_CH)?1:0))
#define MCKEY1_USE_P3 (((MCKEY1_A_CH == SCKEY_P3_CH)?1:0) | ((MCKEY1_B_CH == SCKEY_P3_CH)?1:0) | ((MCKEY1_C_CH == SCKEY_P3_CH)?1:0))
#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 1)
#define MCKEY2_USE_P1 (((MCKEY2_A_CH == SCKEY_P1_CH)?1:0) | ((MCKEY2_B_CH == SCKEY_P1_CH)?1:0) | ((MCKEY2_C_CH == SCKEY_P1_CH)?1:0))
#define MCKEY2_USE_P2 (((MCKEY2_A_CH == SCKEY_P2_CH)?1:0) | ((MCKEY2_B_CH == SCKEY_P2_CH)?1:0) | ((MCKEY2_C_CH == SCKEY_P2_CH)?1:0))
#define MCKEY2_USE_P3 (((MCKEY2_A_CH == SCKEY_P3_CH)?1:0) | ((MCKEY2_B_CH == SCKEY_P3_CH)?1:0) | ((MCKEY2_C_CH == SCKEY_P3_CH)?1:0))
#else
#define MCKEY2_USE_P1 (0)
#define MCKEY2_USE_P2 (0)
#define MCKEY2_USE_P3 (0)
#endif
#endif // (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

